cjb-tech/obs-tally-light-esp8266/OBS_tally_light/OBS_tally_light.cpp
#include "OBS_tally_light.hpp"

#ifndef VERSION
#define VERSION "dev"
#endif

// #define DEBUG_LED_STRIP
#define FASTLED_ALLOW_INTERRUPTS 0

#ifndef CHIP_FAMILY
#define CHIP_FAMILY "Unknown"
#endif

#ifndef VERSION
#define VERSION "Unknown"
#endif

#define DISPLAY_NAME "Tally Light"

//Include libraries:
#if ESP32
#include <esp_wifi.h>
#include <WebServer.h>
#include <WiFi.h>
#else
#include <ESP8266WebServer.h>
#include <ESP8266WiFi.h>
#endif

#include <EEPROM.h>
#include "./OBSWebsocket4.cpp"
#include <FastLED.h>

#if ESP32
//Define LED1 color pins
#ifndef PIN_RED1
#define PIN_RED1 32
#endif
#ifndef PIN_GREEN1
#define PIN_GREEN1 33
#endif
#ifndef PIN_BLUE1
#define PIN_BLUE1 25
#endif

//Define LED2 color pins
#ifndef PIN_RED2
#define PIN_RED2 26
#endif
#ifndef PIN_GREEN2
#define PIN_GREEN2 27
#endif
#ifndef PIN_BLUE2
#define PIN_BLUE2 14
#endif

#else  // ESP8266
//Define LED1 color pins
#ifndef PIN_RED1
#define PIN_RED1 D0
#endif
#ifndef PIN_GREEN1
#define PIN_GREEN1 D2
#endif
#ifndef PIN_BLUE1
#define PIN_BLUE1 D1
#endif

//Define LED2 color pins
#ifndef PIN_RED2
#define PIN_RED2 D4
#endif
#ifndef PIN_GREEN2
#define PIN_GREEN2 D5
#endif
#ifndef PIN_BLUE2
#define PIN_BLUE2 D6
#endif
#endif

//Define LED colors
#define LED_OFF 0
#define LED_RED 1
#define LED_GREEN 2
#define LED_BLUE 3
#define LED_YELLOW 4
#define LED_PINK 5
#define LED_WHITE 6
#define LED_ORANGE 7

//Map "old" LED colors to CRGB colors
CRGB color_led[8] = { CRGB::Black, CRGB::Red, CRGB::Lime, CRGB::Blue, CRGB::Yellow, CRGB::Fuchsia, CRGB::White, CRGB::Orange };

//Define states
#define STATE_STARTING 0
#define STATE_CONNECTING_TO_WIFI 1
#define STATE_CONNECTING_TO_OBS 2
#define STATE_RUNNING 3

//Define modes of operation
#define MODE_NORMAL 1
#define MODE_PREVIEW_STAY_ON 2
#define MODE_PROGRAM_ONLY 3
#define MODE_ON_AIR 4

#define TALLY_FLAG_OFF 0
#define TALLY_FLAG_PROGRAM 1
#define TALLY_FLAG_PREVIEW 2

//Define Neopixel status-LED options
#define NEOPIXEL_STATUS_FIRST 1
#define NEOPIXEL_STATUS_LAST 2
#define NEOPIXEL_STATUS_NONE 3

//FastLED
#ifndef TALLY_DATA_PIN
#if ESP32
#define TALLY_DATA_PIN 12
#elif ARDUINO_ESP8266_NODEMCU
#define TALLY_DATA_PIN 7
#else
#define TALLY_DATA_PIN 13  // D7
#endif
#endif
int numTallyLEDs;
int numStatusLEDs;
CRGB *leds;
CRGB *tallyLEDs;
CRGB *statusLED;
bool neopixelsUpdated = false;

//Initialize global variables
#if ESP32
WebServer server(80);
#else
ESP8266WebServer server(80);
#endif

OBSSocket4 OBSSocket;

uint8_t state = STATE_STARTING;

//Define struct for holding tally settings (mostly to simplify EEPROM read and write, in order to persist settings)
struct Settings {
  char tallyName[32] = "";
  char sourceName[32] = "";
  uint8_t tallyModeLED1;
  uint8_t tallyModeLED2;
  bool staticIP;
  IPAddress tallyIP;
  IPAddress tallySubnetMask;
  IPAddress tallyGateway;
  IPAddress obsIP;
  uint16_t neopixelsAmount;
  uint8_t neopixelStatusLEDOption;
  uint8_t neopixelBrightness;
  uint8_t ledBrightness;
};

Settings settings;

bool firstRun = true;

int bytesAvailable = false;
uint8_t readByte;

//Perform initial setup on power on
void setup() {
  //Init pins for LED
  pinMode(PIN_RED1, OUTPUT);
  pinMode(PIN_GREEN1, OUTPUT);
  pinMode(PIN_BLUE1, OUTPUT);

  pinMode(PIN_RED2, OUTPUT);
  pinMode(PIN_GREEN2, OUTPUT);
  pinMode(PIN_BLUE2, OUTPUT);

  setBothLEDs(LED_BLUE);

  //Start Serial
  Serial.begin(74880);
  Serial.println("########################");
  Serial.println("Serial started");

  //Read settings from EEPROM. WIFI settings are stored separately by the ESP
  EEPROM.begin(sizeof(settings));  //Needed on ESP8266 module, as EEPROM lib works a bit differently than on a regular Arduino
  EEPROM.get(0, settings);

  //Initialize LED strip
  if (0 < settings.neopixelsAmount && settings.neopixelsAmount <= 1000) {
    leds = new CRGB[settings.neopixelsAmount];
    FastLED.addLeds<NEOPIXEL, TALLY_DATA_PIN>(leds, settings.neopixelsAmount);

    if (settings.neopixelStatusLEDOption != NEOPIXEL_STATUS_NONE) {
      numStatusLEDs = 1;
      numTallyLEDs = settings.neopixelsAmount - numStatusLEDs;
      if (settings.neopixelStatusLEDOption == NEOPIXEL_STATUS_FIRST) {
        statusLED = leds;
        tallyLEDs = leds + numStatusLEDs;
      } else {  // if last or or other value
        statusLED = leds + numTallyLEDs;
        tallyLEDs = leds;
      }
    } else {
      numTallyLEDs = settings.neopixelsAmount;
      numStatusLEDs = 0;
      tallyLEDs = leds;
    }
  } else {
    settings.neopixelsAmount = 0;
    numTallyLEDs = 0;
    numStatusLEDs = 0;
  }

  FastLED.setBrightness(settings.neopixelBrightness);
  setSTRIP(LED_OFF);
  setStatusLED(LED_BLUE);
  FastLED.show();

  Serial.println(settings.tallyName);

  if (settings.staticIP && settings.tallyIP != IPADDR_NONE) {
    WiFi.config(settings.tallyIP, settings.tallyGateway, settings.tallySubnetMask);
  } else {
    settings.staticIP = false;
  }

  //Put WiFi into station mode and make it connect to saved network
  WiFi.mode(WIFI_STA);
#if ESP32
  WiFi.setHostname(settings.tallyName);
#else
  WiFi.hostname(settings.tallyName);
#endif
  WiFi.setAutoReconnect(true);
  WiFi.begin();

  Serial.println("------------------------");
  Serial.println("Connecting to WiFi...");
  Serial.println("Network name (SSID): " + getSSID());

  // Initialize and begin HTTP server for handeling the web interface
  server.on("/", handleRoot);
  server.on("/save", handleSave);
  server.onNotFound(handleNotFound);
  server.begin();

  //Set state to connecting before entering loop
  changeState(STATE_CONNECTING_TO_WIFI);
}

void loop() {
  switch (state) {
    case STATE_CONNECTING_TO_WIFI:
      if (WiFi.status() == WL_CONNECTED) {
        WiFi.mode(WIFI_STA);  // Disable softAP if connection is successful
        Serial.println("------------------------");
        Serial.println("Connected to WiFi:   " + getSSID());
        Serial.println("IP:                  " + WiFi.localIP().toString());
        Serial.println("Subnet Mask:         " + WiFi.subnetMask().toString());
        Serial.println("Gateway IP:          " + WiFi.gatewayIP().toString());
        changeState(STATE_CONNECTING_TO_OBS);
      } else if (firstRun) {
        firstRun = false;
        Serial.println("Unable to connect. Serving \"Tally Light setup\" WiFi for configuration, while still trying to connect...");
        WiFi.softAP((String)DISPLAY_NAME + " setup");
        WiFi.mode(WIFI_AP_STA);  // Enable softAP to access web interface in case of no WiFi
        setBothLEDs(LED_WHITE);
        setStatusLED(LED_WHITE);
      }
      break;

