cjb-tech/obs-tally-light-esp8266/OBS_tally_light/OBS_tally_light.cpp
    case STATE_CONNECTING_TO_OBS:
      // Initialize a connection to the OBS:
      if (firstRun) {
        OBSSocket.begin(settings.obsIP);
        OBSSocket.connect();
        Serial.println("------------------------");
        Serial.println("Connecting to OBS...");
        Serial.println((String) "OBS IP:         " + settings.obsIP[0] + "." + settings.obsIP[1] + "." + settings.obsIP[2] + "." + settings.obsIP[3]);
        firstRun = false;
      }
      OBSSocket.runLoop();
      if (OBSSocket.isConnected()) {
        changeState(STATE_RUNNING);
        Serial.println("Connected to OBS");
      }
      break;

    case STATE_RUNNING:
      //Handle data exchange and connection to swithcher
      OBSSocket.runLoop();

      //Switch state if ATEM connection is lost...
      if (!OBSSocket.isConnected()) {  // will return false if the connection was lost
        Serial.println("------------------------");
        Serial.println("Connection to OBS lost...");
        changeState(STATE_CONNECTING_TO_OBS);
      } else {
        //Set LED and Neopixel colors accordingly
        int color = getLedColor(settings.tallyModeLED1, String(settings.sourceName));
        setLED1(color);
        setSTRIP(color);

        color = getLedColor(settings.tallyModeLED2, String(settings.sourceName));
        setLED2(color);
      }
      break;
  }

  //Switch state if WiFi connection is lost...
  if (WiFi.status() != WL_CONNECTED && state != STATE_CONNECTING_TO_WIFI) {
    Serial.println("------------------------");
    Serial.println("WiFi connection lost...");
    changeState(STATE_CONNECTING_TO_WIFI);

    //Force atem library to reset connection, in order for status to read correctly on website.
    OBSSocket.begin(settings.obsIP);
    OBSSocket.connect();
  }

  //Show strip only on updates
  if (neopixelsUpdated) {
    FastLED.show();
    neopixelsUpdated = false;
  }

  //Handle web interface
  server.handleClient();
}

//Handle the change of states in the program
void changeState(uint8_t stateToChangeTo) {
  firstRun = true;
  switch (stateToChangeTo) {
    case STATE_CONNECTING_TO_WIFI:
      state = STATE_CONNECTING_TO_WIFI;
      setBothLEDs(LED_BLUE);
      setStatusLED(LED_BLUE);
      setSTRIP(LED_OFF);
      break;
    case STATE_CONNECTING_TO_OBS:
      state = STATE_CONNECTING_TO_OBS;
      setBothLEDs(LED_PINK);
      setStatusLED(LED_PINK);
      setSTRIP(LED_OFF);
      break;
    case STATE_RUNNING:
      state = STATE_RUNNING;
      setBothLEDs(LED_GREEN);
      setStatusLED(LED_ORANGE);
      break;
  }
}

//Set the color of both LEDs
void setBothLEDs(uint8_t color) {
  setLED(color, PIN_RED1, PIN_GREEN1, PIN_BLUE1);
  setLED(color, PIN_RED2, PIN_GREEN2, PIN_BLUE2);
}

//Set the color of the 1st LED
void setLED1(uint8_t color) {
  setLED(color, PIN_RED1, PIN_GREEN1, PIN_BLUE1);
}

//Set the color of the 2nd LED
void setLED2(uint8_t color) {
  setLED(color, PIN_RED2, PIN_GREEN2, PIN_BLUE2);
}

//Set the color of a LED using the given pins
void setLED(uint8_t color, int pinRed, int pinGreen, int pinBlue) {
  digitalWrite(pinRed, 0);
  digitalWrite(pinGreen, 0);
  digitalWrite(pinBlue, 0);
#if ESP32
  switch (color) {
    case LED_OFF:
      digitalWrite(pinRed, 0);
      digitalWrite(pinGreen, 0);
      digitalWrite(pinBlue, 0);
      break;
    case LED_RED:
      digitalWrite(pinRed, 1);
      digitalWrite(pinGreen, 0);
      digitalWrite(pinBlue, 0);
      break;
    case LED_GREEN:
      digitalWrite(pinRed, 0);
      digitalWrite(pinGreen, 1);
      digitalWrite(pinBlue, 0);
      break;
    case LED_BLUE:
      digitalWrite(pinRed, 0);
      digitalWrite(pinGreen, 0);
      digitalWrite(pinBlue, 1);
      break;
    case LED_YELLOW:
      digitalWrite(pinRed, 1);
      digitalWrite(pinGreen, 1);
      digitalWrite(pinBlue, 0);
      break;
    case LED_PINK:
      digitalWrite(pinRed, 1);
      digitalWrite(pinGreen, 0);
      digitalWrite(pinBlue, 1);
      break;
    case LED_WHITE:
      digitalWrite(pinRed, 1);
      digitalWrite(pinGreen, 1);
      digitalWrite(pinBlue, 1);
      break;
  }
#else
  uint8_t ledBrightness = settings.ledBrightness;
  void (*writeFunc)(uint8_t, uint8_t);
  if (ledBrightness >= 0xff) {
    writeFunc = &digitalWrite;
    ledBrightness = 1;
  } else {
    writeFunc = &analogWriteWrapper;
  }

  switch (color) {
    case LED_OFF:
      digitalWrite(pinRed, 0);
      digitalWrite(pinGreen, 0);
      digitalWrite(pinBlue, 0);
      break;
    case LED_RED:
      writeFunc(pinRed, ledBrightness);
      digitalWrite(pinGreen, 0);
      digitalWrite(pinBlue, 0);
      break;
    case LED_GREEN:
      digitalWrite(pinRed, 0);
      writeFunc(pinGreen, ledBrightness);
      digitalWrite(pinBlue, 0);
      break;
    case LED_BLUE:
      digitalWrite(pinRed, 0);
      digitalWrite(pinGreen, 0);
      writeFunc(pinBlue, ledBrightness);
      break;
    case LED_YELLOW:
      writeFunc(pinRed, ledBrightness);
      writeFunc(pinGreen, ledBrightness);
      digitalWrite(pinBlue, 0);
      break;
    case LED_PINK:
      writeFunc(pinRed, ledBrightness);
      digitalWrite(pinGreen, 0);
      writeFunc(pinBlue, ledBrightness);
      break;
    case LED_WHITE:
      writeFunc(pinRed, ledBrightness);
      writeFunc(pinGreen, ledBrightness);
      writeFunc(pinBlue, ledBrightness);
      break;
  }
#endif
}

void analogWriteWrapper(uint8_t pin, uint8_t value) {
  analogWrite(pin, value);
}

//Set the color of the LED strip, except for the status LED
void setSTRIP(uint8_t color) {
  if (numTallyLEDs > 0 && tallyLEDs[0] != color_led[color]) {
    for (int i = 0; i < numTallyLEDs; i++) {
      tallyLEDs[i] = color_led[color];
    }
    neopixelsUpdated = true;
#ifdef DEBUG_LED_STRIP
    Serial.println("Tally:  ");
    printLeds();
#endif
  }
}

//Set the single status LED (last LED)
void setStatusLED(uint8_t color) {
  if (numStatusLEDs > 0 && statusLED[0] != color_led[color]) {
    for (int i = 0; i < numStatusLEDs; i++) {
      statusLED[i] = color_led[color];
      if (color == LED_ORANGE) {
        statusLED[i].fadeToBlackBy(230);
      } else {
        statusLED[i].fadeToBlackBy(0);
      }
    }
    neopixelsUpdated = true;
#ifdef DEBUG_LED_STRIP
    Serial.println("Status: ");
    printLeds();
#endif
  }
}

#ifdef DEBUG_LED_STRIP
void printLeds() {
  for (int i = 0; i < settings.neopixelsAmount; i++) {
    Serial.print(i);
    Serial.print(", RGB: ");
    Serial.print(leds[i].r);
    Serial.print(", ");
    Serial.print(leds[i].g);
    Serial.print(", ");
    Serial.println(leds[i].b);
  }
  Serial.println();
}
#endif

