cjb-tech/obs-tally-light-esp8266/OBS_tally_light/OBS_tally_light.cpp
int getTallyState(String tallyName) {
  if (OBSSocket.getProgramScene().equals(tallyName)) {
    return TALLY_FLAG_PROGRAM;
  }
  if (OBSSocket.getPreviewScene().equals(tallyName)) {
    return TALLY_FLAG_PREVIEW;
  }
  return TALLY_FLAG_OFF;
}

int getLedColor(int tallyMode, String tallyName) {
  if (tallyMode == MODE_ON_AIR) {
    if (OBSSocket.getStreamStreaming()) {
      return LED_RED;
    }
    return LED_OFF;
  }

  int tallyState = getTallyState(tallyName);

  if (tallyState == TALLY_FLAG_PROGRAM) {  //if tally live
    return LED_RED;
  } else if ((tallyState == TALLY_FLAG_PREVIEW       //if tally preview
              || tallyMode == MODE_PREVIEW_STAY_ON)  //or preview stay on
             && tallyMode != MODE_PROGRAM_ONLY) {    //and not program only
    return LED_GREEN;
  } else {  //if tally is neither
    return LED_OFF;
  }
}

//Serve setup web page to client, by sending HTML with the correct variables
void handleRoot() {
  String html = "<!DOCTYPE html><html><head><meta charset=\"ASCII\"><meta name=\"viewport\"content=\"width=device-width,initial-scale=1.0\"><title>Tally Light setup</title></head><script>function switchIpField(e){console.log(\"switch\");console.log(e);var target=e.srcElement||e.target;var maxLength=parseInt(target.attributes[\"maxlength\"].value,10);var myLength=target.value.length;if(myLength>=maxLength){var next=target.nextElementSibling;if(next!=null){if(next.className.includes(\"IP\")){next.focus();}}}else if(myLength==0){var previous=target.previousElementSibling;if(previous!=null){if(previous.className.includes(\"IP\")){previous.focus();}}}}function ipFieldFocus(e){console.log(\"focus\");console.log(e);var target=e.srcElement||e.target;target.select();}function load(){var containers=document.getElementsByClassName(\"IP\");for(var i=0;i<containers.length;i++){var container=containers[i];container.oninput=switchIpField;container.onfocus=ipFieldFocus;}containers=document.getElementsByClassName(\"tIP\");for(var i=0;i<containers.length;i++){var container=containers[i];container.oninput=switchIpField;container.onfocus=ipFieldFocus;}toggleStaticIPFields();}function toggleStaticIPFields(){var enabled=document.getElementById(\"staticIP\").checked;document.getElementById(\"staticIPHidden\").disabled=enabled;var staticIpFields=document.getElementsByClassName('tIP');for(var i=0;i<staticIpFields.length;i++){staticIpFields[i].disabled=!enabled;}}</script><style>a{color:#0F79E0}</style><body style=\"font-family:Verdana;white-space:nowrap;\"onload=\"load()\"><table cellpadding=\"2\"style=\"width:100%\"><tr bgcolor=\"#142839\"style=\"color:#ffffff;font-size:.8em;\"><td colspan=\"3\"><h1>&nbsp;" + (String)DISPLAY_NAME + " setup</h1><h2>&nbsp;Status:</h2></td></tr><tr><td><br></td><td></td><td style=\"width:100%;\"></td></tr><tr><td>Connection Status:</td><td colspan=\"2\">";
  switch (WiFi.status()) {
    case WL_CONNECTED:
      html += "Connected to network";
      break;
    case WL_NO_SSID_AVAIL:
      html += "Network not found";
      break;
    case WL_CONNECT_FAILED:
      html += "Invalid password";
      break;
    case WL_IDLE_STATUS:
      html += "Changing state...";
      break;
    case WL_DISCONNECTED:
      html += "Station mode disabled";
      break;
#if ESP32
    default:
#else
    case -1:
#endif
      html += "Timeout";
      break;
  }

  html += "</td></tr><tr><td>Network name (SSID):</td><td colspan=\"2\">";
  html += getSSID();
  html += "</td></tr><tr><td><br></td></tr><tr><td>Signal strength:</td><td colspan=\"2\">";
  html += WiFi.RSSI();
  html += " dBm</td></tr>";
  //Commented out for users without batteries
  // html += "<tr><td><br></td></tr><tr><td>Battery voltage:</td><td colspan=\"2\">";
  // html += dtostrf(uBatt, 0, 3, buffer);
  // html += " V</td></tr>";
  html += "<tr><td>Static IP:</td><td colspan=\"2\">";
  html += settings.staticIP == true ? "True" : "False";
  html += "</td></tr><tr><td>" + (String)DISPLAY_NAME + " IP:</td><td colspan=\"2\">";
  html += WiFi.localIP().toString();
  html += "</td></tr><tr><td>Subnet mask: </td><td colspan=\"2\">";
  html += WiFi.subnetMask().toString();
  html += "</td></tr><tr><td>Gateway: </td><td colspan=\"2\">";
  html += WiFi.gatewayIP().toString();
  html += "</td></tr><tr><td><br></td></tr>";
  html += "<tr><td>OBS status:</td><td colspan=\"2\">";
  if (OBSSocket.isRejected())
    html += "<span style=\"color: #bb0000; background-color: #ffaaaa;\">Connection rejected - No empty spot</span>";
  else if (OBSSocket.isConnected())
    html += "<span style=\"color: #00bb00; background-color: #aaffaa;\">Connected</span>";  // - Wating for initialization";
  else if (WiFi.status() == WL_CONNECTED)
    html += "<span style=\"color: #ffffff; background-color: #ff55ff;\">Disconnected - No response from OBS</span>";
  else
    html += "<span style=\"color: #ffffff; background-color: #2121ff;\">Disconnected - Waiting for WiFi</span>";
  html += "</td></tr><tr><td>OBS IP:</td><td colspan=\"2\">";
  html += (String)settings.obsIP[0] + '.' + settings.obsIP[1] + '.' + settings.obsIP[2] + '.' + settings.obsIP[3];
  html += "</td></tr><tr><td><br></td></tr>";
  html += "<tr bgcolor=\"#142839\"style=\"color:#ffffff;font-size:.8em;\"><td colspan=\"3\"><h2>&nbsp;Settings:</h2></td></tr><tr><td><br></td></tr><form action=\"/save\"method=\"post\"><tr><td>Tally Light name: </td><td><input type=\"text\"size=\"30\"maxlength=\"30\"name=\"tName\"value=\"";
#if ESP32
  html += WiFi.getHostname();
#else
  html += WiFi.hostname();
#endif
  html += "\"required/></td></tr><tr><td><br></td></tr><tr><td>OBS Source Name: </td><td><input type =\"text\"size=\"30\"maxlength=\"30\"name=\"source\"value=\"";
  html += settings.sourceName;
  html += "\"required/></td></tr><tr><tr><td>OBS IP: </td><td><input class=\"IP\"type=\"text\"size=\"3\"maxlength=\"3\"name=\"aIP1\"pattern=\"\\d{0,3}\"value=\"";
  html += settings.obsIP[0];
  html += "\"required/>. <input class=\"IP\"type=\"text\"size=\"3\"maxlength=\"3\"name=\"aIP2\"pattern=\"\\d{0,3}\"value=\"";
  html += settings.obsIP[1];
  html += "\"required/>. <input class=\"IP\"type=\"text\"size=\"3\"maxlength=\"3\"name=\"aIP3\"pattern=\"\\d{0,3}\"value=\"";
  html += settings.obsIP[2];
  html += "\"required/>. <input class=\"IP\"type=\"text\"size=\"3\"maxlength=\"3\"name=\"aIP4\"pattern=\"\\d{0,3}\"value=\"";
  html += settings.obsIP[3];
  html += "\"required/></tr>";
  html += "<tr><td><br></td></tr><td><br></td></tr><tr><td>Tally Light mode (LED 1):&nbsp;</td><td><select name=\"tModeLED1\"><option value=\"";
  html += (String)MODE_NORMAL + "\"";
  if (settings.tallyModeLED1 == MODE_NORMAL)
    html += "selected";
  html += ">Normal</option><option value=\"";
  html += (String)MODE_PREVIEW_STAY_ON + "\"";
  if (settings.tallyModeLED1 == MODE_PREVIEW_STAY_ON)
    html += "selected";
  html += ">Preview stay on</option><option value=\"";
  html += (String)MODE_PROGRAM_ONLY + "\"";
  if (settings.tallyModeLED1 == MODE_PROGRAM_ONLY)
    html += "selected";
  html += ">Program only</option><option value=\"";
  html += (String)MODE_ON_AIR + "\"";
  if (settings.tallyModeLED1 == MODE_ON_AIR)
    html += "selected";
  html += ">On Air</option></select></td></tr><tr><td>Tally Light mode (LED 2):</td><td><select name=\"tModeLED2\"><option value=\"";
  html += (String)MODE_NORMAL + "\"";
  if (settings.tallyModeLED2 == MODE_NORMAL)
    html += "selected";
  html += ">Normal</option><option value=\"";
  html += (String)MODE_PREVIEW_STAY_ON + "\"";
  if (settings.tallyModeLED2 == MODE_PREVIEW_STAY_ON)
    html += "selected";
  html += ">Preview stay on</option><option value=\"";
  html += (String)MODE_PROGRAM_ONLY + "\"";
  if (settings.tallyModeLED2 == MODE_PROGRAM_ONLY)
    html += "selected";
  html += ">Program only</option><option value=\"";
  html += (String)MODE_ON_AIR + "\"";
  if (settings.tallyModeLED2 == MODE_ON_AIR)
    html += "selected";
  html += ">On Air</option></select></td></tr><tr><td> Led brightness: </td><td><input type=\"number\"size=\"5\"min=\"0\"max=\"255\"name=\"ledBright\"value=\"";
  html += settings.ledBrightness;
  html += "\"required/></td></tr><tr><td><br></td></tr><tr><td>Amount of Neopixels:</td><td><input type=\"number\"size=\"5\"min=\"0\"max=\"1000\"name=\"neoPxAmount\"value=\"";
  html += settings.neopixelsAmount;
  html += "\"required/></td></tr><tr><td>Neopixel status LED: </td><td><select name=\"neoPxStatus\"><option value=\"";
  html += (String)NEOPIXEL_STATUS_FIRST + "\"";
  if (settings.neopixelStatusLEDOption == NEOPIXEL_STATUS_FIRST)
    html += "selected";
  html += ">First LED</option><option value=\"";
  html += (String)NEOPIXEL_STATUS_LAST + "\"";
  if (settings.neopixelStatusLEDOption == NEOPIXEL_STATUS_LAST)
    html += "selected";
  html += ">Last LED</option><option value=\"";
  html += (String)NEOPIXEL_STATUS_NONE + "\"";
  if (settings.neopixelStatusLEDOption == NEOPIXEL_STATUS_NONE)
    html += "selected";
  html += ">None</option></select></td></tr><tr><td> Neopixel brightness: </td><td><input type=\"number\"size=\"5\"min=\"0\"max=\"255\"name=\"neoPxBright\"value=\"";
  html += settings.neopixelBrightness;
  html += "\"required/></td></tr><tr><td><br></td></tr><tr><td>Network name(SSID): </td><td><input type =\"text\"size=\"30\"maxlength=\"30\"name=\"ssid\"value=\"";
  html += getSSID();
  html += "\"required/></td></tr><tr><td>Network password: </td><td><input type=\"password\"size=\"30\"maxlength=\"30\"name=\"pwd\"pattern=\"^$|.{8,32}\"value=\"";
  if (WiFi.isConnected())  //As a minimum security meassure, to only send the wifi password if it's currently connected to the given network.
    html += WiFi.psk();
  html += "\"/></td></tr><tr><td><br></td></tr><tr><td>Use static IP: </td><td><input type=\"hidden\"id=\"staticIPHidden\"name=\"staticIP\"value=\"false\"/><input id=\"staticIP\"type=\"checkbox\"name=\"staticIP\"value=\"true\"onchange=\"toggleStaticIPFields()\"";
  if (settings.staticIP)
    html += "checked";
  html += "/></td></tr><tr><td>" + (String)DISPLAY_NAME + " IP: </td><td><input class=\"tIP\"type=\"text\"size=\"3\"maxlength=\"3\"name=\"tIP1\"pattern=\"\\d{0,3}\"value=\"";
  html += settings.tallyIP[0];
  html += "\"required/>. <input class=\"tIP\"type=\"text\"size=\"3\"maxlength=\"3\"name=\"tIP2\"pattern=\"\\d{0,3}\"value=\"";
  html += settings.tallyIP[1];
  html += "\"required/>. <input class=\"tIP\"type=\"text\"size=\"3\"maxlength=\"3\"name=\"tIP3\"pattern=\"\\d{0,3}\"value=\"";
  html += settings.tallyIP[2];
  html += "\"required/>. <input class=\"tIP\"type=\"text\"size=\"3\"maxlength=\"3\"name=\"tIP4\"pattern=\"\\d{0,3}\"value=\"";
  html += settings.tallyIP[3];
  html += "\"required/></td></tr><tr><td>Subnet mask: </td><td><input class=\"tIP\"type=\"text\"size=\"3\"maxlength=\"3\"name=\"mask1\"pattern=\"\\d{0,3}\"value=\"";
  html += settings.tallySubnetMask[0];
  html += "\"required/>. <input class=\"tIP\"type=\"text\"size=\"3\"maxlength=\"3\"name=\"mask2\"pattern=\"\\d{0,3}\"value=\"";
  html += settings.tallySubnetMask[1];
  html += "\"required/>. <input class=\"tIP\"type=\"text\"size=\"3\"maxlength=\"3\"name=\"mask3\"pattern=\"\\d{0,3}\"value=\"";
  html += settings.tallySubnetMask[2];
  html += "\"required/>. <input class=\"tIP\"type=\"text\"size=\"3\"maxlength=\"3\"name=\"mask4\"pattern=\"\\d{0,3}\"value=\"";
  html += settings.tallySubnetMask[3];
  html += "\"required/></td></tr><tr><td>Gateway: </td><td><input class=\"tIP\"type=\"text\"size=\"3\"maxlength=\"3\"name=\"gate1\"pattern=\"\\d{0,3}\"value=\"";
  html += settings.tallyGateway[0];
  html += "\"required/>. <input class=\"tIP\"type=\"text\"size=\"3\"maxlength=\"3\"name=\"gate2\"pattern=\"\\d{0,3}\"value=\"";
  html += settings.tallyGateway[1];
  html += "\"required/>. <input class=\"tIP\"type=\"text\"size=\"3\"maxlength=\"3\"name=\"gate3\"pattern=\"\\d{0,3}\"value=\"";
  html += settings.tallyGateway[2];
  html += "\"required/>. <input class=\"tIP\"type=\"text\"size=\"3\"maxlength=\"3\"name=\"gate4\"pattern=\"\\d{0,3}\"value=\"";
  html += settings.tallyGateway[3];
  html += "\"required/></td></tr>";
  html += "<tr><td><br></td></tr><tr><td/><td style=\"float: right;\"><input type=\"submit\"value=\"Save Changes\"/></td></tr></form><tr bgcolor=\"#cccccc\"style=\"font-size: .8em;\"><td colspan=\"3\"><p>&nbsp;&copy; 2023 <a href=\"https://github.com/cjb-tech/\" target=\"_blank\">CJB Tech Team</a></p><p>&nbsp;Based on <a href=\"https://aronhetlam.github.io/ATEM_tally_light_with_ESP8266/\" target=\"_blank\">Wireless ATEM tally lights by aronhetlam</a></p></td></tr></table></body></html>";
  server.send(200, "text/html", html);
}

//Save new settings from client in EEPROM and restart the ESP8266 module
void handleSave() {
  if (server.method() != HTTP_POST) {
    server.send(405, "text/html", "<!DOCTYPE html><html><head><meta charset=\"ASCII\"><meta name=\"viewport\"content=\"width=device-width, initial-scale=1.0\"><title>Tally Light setup</title></head><body style=\"font-family:Verdana;\"><table bgcolor=\"#777777\"border=\"0\"width=\"100%\"cellpadding=\"1\"style=\"color:#ffffff;font-size:.8em;\"><tr><td><h1>&nbsp;" + (String)DISPLAY_NAME + " setup</h1></td></tr></table><br>Request without posting settings not allowed</body></html>");
  } else {
    String ssid;
    String pwd;
    bool change = false;
    for (uint8_t i = 0; i < server.args(); i++) {
      change = true;
      String var = server.argName(i);
      String val = server.arg(i);

      if (var == "tName") {
        val.toCharArray(settings.tallyName, (uint8_t)32);
      } else if (var == "source") {
        val.toCharArray(settings.sourceName, (uint8_t)32);
      } else if (var == "tModeLED1") {
        settings.tallyModeLED1 = val.toInt();
      } else if (var == "tModeLED2") {
        settings.tallyModeLED2 = val.toInt();
      } else if (var == "ledBright") {
        settings.ledBrightness = val.toInt();
      } else if (var == "neoPxAmount") {
        settings.neopixelsAmount = val.toInt();
      } else if (var == "neoPxStatus") {
        settings.neopixelStatusLEDOption = val.toInt();
      } else if (var == "neoPxBright") {
        settings.neopixelBrightness = val.toInt();
      } else if (var == "ssid") {
        ssid = String(val);
      } else if (var == "pwd") {
        pwd = String(val);
      } else if (var == "staticIP") {
        settings.staticIP = (val == "true");
      } else if (var == "tIP1") {
        settings.tallyIP[0] = val.toInt();
      } else if (var == "tIP2") {
        settings.tallyIP[1] = val.toInt();
      } else if (var == "tIP3") {
        settings.tallyIP[2] = val.toInt();
      } else if (var == "tIP4") {
        settings.tallyIP[3] = val.toInt();
      } else if (var == "mask1") {
        settings.tallySubnetMask[0] = val.toInt();
      } else if (var == "mask2") {
        settings.tallySubnetMask[1] = val.toInt();
      } else if (var == "mask3") {
        settings.tallySubnetMask[2] = val.toInt();
      } else if (var == "mask4") {
        settings.tallySubnetMask[3] = val.toInt();
      } else if (var == "gate1") {
        settings.tallyGateway[0] = val.toInt();
      } else if (var == "gate2") {
        settings.tallyGateway[1] = val.toInt();
      } else if (var == "gate3") {
        settings.tallyGateway[2] = val.toInt();
      } else if (var == "gate4") {
        settings.tallyGateway[3] = val.toInt();
      } else if (var == "aIP1") {
        settings.obsIP[0] = val.toInt();
      } else if (var == "aIP2") {
        settings.obsIP[1] = val.toInt();
      } else if (var == "aIP3") {
        settings.obsIP[2] = val.toInt();
      } else if (var == "aIP4") {
        settings.obsIP[3] = val.toInt();
      }
    }

    if (change) {
      EEPROM.put(0, settings);
      EEPROM.commit();

      server.send(200, "text/html", (String) "<!DOCTYPE html><html><head><meta charset=\"ASCII\"><meta name=\"viewport\"content=\"width=device-width, initial-scale=1.0\"><title>Tally Light setup</title></head><body><table bgcolor=\"#777777\"border=\"0\"width=\"100%\"cellpadding=\"1\"style=\"font-family:Verdana;color:#ffffff;font-size:.8em;\"><tr><td><h1>&nbsp;" + (String)DISPLAY_NAME + " setup</h1></td></tr></table><br>Settings saved successfully.</body></html>");

      // Delay to let data be saved, and the response to be sent properly to the client
      server.close();  // Close server to flush and ensure the response gets to the client
      delay(100);

      // Change into STA mode to disable softAP
      WiFi.mode(WIFI_STA);
      delay(100);  // Give it time to switch over to STA mode (this is important on the ESP32 at least)

      if (ssid && pwd) {
        WiFi.persistent(true);  // Needed by ESP8266
        // Pass in 'false' as 5th (connect) argument so we don't waste time trying to connect, just save the new SSID/PSK
        // 3rd argument is channel - '0' is default. 4th argument is BSSID - 'NULL' is default.
        WiFi.begin(ssid.c_str(), pwd.c_str(), 0, NULL, false);
      }

      //Delay to apply settings before restart
      delay(100);
      ESP.restart();
    }
  }
}

//Send 404 to client in case of invalid webpage being requested.
void handleNotFound() {
  server.send(404, "text/html", "<!DOCTYPE html><html><head><meta charset=\"ASCII\"><meta name=\"viewport\"content=\"width=device-width, initial-scale=1.0\"><title>" + (String)DISPLAY_NAME + " setup</title></head><body style=\"font-family:Verdana;\"><table bgcolor=\"#777777\"border=\"0\"width=\"100%\"cellpadding=\"1\"style=\"color:#ffffff;font-size:.8em;\"><tr><td><h1>&nbsp Tally Light setup</h1></td></tr></table><br>404 - Page not found</body></html>");
}

String getSSID() {
#if ESP32
  wifi_config_t conf;
  esp_wifi_get_config(WIFI_IF_STA, &conf);
  return String(reinterpret_cast<const char *>(conf.sta.ssid));
#else
  return WiFi.SSID();
#endif
}
